# SetTileRepetitionPoint

## Description
Sets the specified tile resource's repetition point.

```pascal
PROCEDURE SetTileRepetitionPoint(
				tileHandle      : HANDLE;
				repetitionPoint : REAL);
```

```python

def vs.SetTileRepetitionPoint(tileHandle, repetitionPoint):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|tileHandle|HANDLE|The tile resource in which to set the repetition point.|
|repetitionPoint|REAL|The repetition point to be set.|

## Examples
```pascal
SetTileRepetitionPoint(tileHandle, repetitionPoint);
```

## See Also
VS Functions:
CreateTile| ShowEditTileDialog| ShowEditTileSettingsDialog| ShowNewTileDialog| GetTileGeometryGroup| BeginGroupN| AddTileGeometryObject| GetTileGroupParent| IsTileGroupContainedObject| GetTileBackgroundColor| SetTileBackgroundColor| GetTileRepetitionPoint| SetTileRepetitionPoint| GetTileOffsetPoint| SetTileOffsetPoint

## Version
Availability: from Vectorworks 2011
## Category
* Document Attributes